Revit 2027 API
MEPNetworkSegmentData Methods
The MEPNetworkSegmentData type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetDownstreamSegments |  Gets all downstream network segments.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetUpstreamSegments |  Gets all upstream network segments.
IsValid |  Verified if this segment data has been assigned some valid values afer calculation.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace